# CLI tool for working with Architecture Decision Records
# https://github.com/npryce/adr-tools
brew "adr-tools"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
# https://antigen.sharats.me/
brew "antigen"
# Clone of cat(1) with syntax highlighting and Git integration
# https://github.com/sharkdp/bat
brew "bat"
# GNU File, Shell, and Text utilities
# https://www.gnu.org/software/coreutils/
brew "coreutils"
# Simple, fast and user-friendly alternative to find
# https://github.com/sharkdp/fd
brew "fd"
# Collection of GNU find, xargs, and locate
# https://www.gnu.org/software/findutils/
brew "findutils"
# Command-line fuzzy finder written in Go
# https://github.com/junegunn/fzf
brew "fzf"
# GitHub command-line tool
# https://cli.github.com/
brew "gh"
# Lightweight and flexible command-line JSON processor
# https://jqlang.github.io/jq/
brew "jq"
# Clone of ls with colorful output, file type icons, and more
# https://github.com/lsd-rs/lsd
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
# https://neovim.io/
brew "neovim"
# Tools for one-time password authentication systems
# https://www.nongnu.org/oath-toolkit/
brew "oath-toolkit"
# Create, run, and share large language models (LLMs)
# https://ollama.com/
brew "ollama"
# Search tool like grep and The Silver Searcher
# https://github.com/BurntSushi/ripgrep
brew "ripgrep"
# Utility that provides fast incremental file transfer
# https://rsync.samba.org/
brew "rsync"
# Terminal multiplexer with VT100/ANSI terminal emulation
# https://www.gnu.org/software/screen/
brew "screen"
# Cross-shell prompt for astronauts
# https://starship.rs/
brew "starship"
# Official tldr client written in Rust
# https://tldr.sh/tlrc/
brew "tlrc"
# Terminal multiplexer
# https://tmux.github.io/
brew "tmux"
# Display directories as trees (with optional color/HTML output)
# https://oldmanprogrammer.net/source.php?dir=projects/tree
brew "tree"
# Internet file retriever
# https://www.gnu.org/software/wget/
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
# https://github.com/mikefarah/yq
brew "yq"
# Shell extension to navigate your filesystem faster
# https://github.com/ajeetdsouza/zoxide
brew "zoxide"

# https://www.sourcegear.com/diffmerge/ -- deprecated
cask "diffmerge"
# https://www.docker.com/
cask "docker"
# https://www.dropbox.com/
cask "dropbox"
# https://github.com/ryanoasis/nerd-fonts
cask "font-meslo-lg-nerd-font"
# https://fork.dev/
cask "fork"
# https://www.google.com/chrome/
cask "google-chrome"
# https://gpgtools.org/
cask "gpg-suite"
# https://keybase.io/
cask "keybase"
# https://www.leapp.cloud/
cask "leapp"
# https://obsidian.md/
cask "obsidian"
# https://www.postman.com/
cask "postman"
# https://www.postman.com/downloads/
cask "postman-cli"
# https://signal.org/
cask "signal"
# https://slack.com/
cask "slack"
# https://theunarchiver.com/
cask "the-unarchiver"
# https://code.visualstudio.com/
cask "visual-studio-code"
# https://www.videolan.org/vlc/
cask "vlc"
# https://wezterm.org/
cask "wezterm"
